In [2]:
import pandas as pd

In [3]:
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}

df = pd.DataFrame(data)

In [3]:
df

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Luis    30  Barcelona
2  Carlos    22   Valencia
3    Sara    27     Bilbao

In [8]:
data = {
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
    'Edad': [25, 30, 22, 27],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']
}

df = pd.DataFrame(data)

In [10]:
df["Edad_en_10_años"] = df["Edad"]+10

In [12]:
df["Ciudad"] = df["Ciudad"].str.lower()

In [13]:
df

   Nombre  Edad     Ciudad  Edad_en_10_años
0     Ana    25     madrid               35
1    Luis    30  barcelona               40
2  Carlos    22   valencia               32
3    Sara    27     bilbao               37